//
//                                                                                                                                          ЗРОБЛЕНО
//                                                                                                                                  Создать массив одномерный, заполненный со всеми типами данных.
//                                                                                                                                     Сложить два массива, каждый элемент одного массива с каждым элементом другого массива,
//                                                                                                                                     в первом массиве 4 элемента во втором 5 элементов.
//                                                                                                                                         Обратить внимание на индексы массивов и элементы, что это разные понятия.

//                                                                                                                                       Сделать три цикла различных с предусловием, пост условием и параметром, в которые поместить в тело цикла,
//                                                                                                                                    арифметическую и геометрическую прогрессию, с 1 до 12.


//                                                                                                                              ЗРОБЛЕНО  factorial
//                                                                                                                           Задача со звездочкой.
//                                                                                                                              вывести последовательность фибоначи. до того числа которое введет пользователь.

//                                                                                                                          ЗРОБЛЕНО
//                                                                                                                              Задача -25
//                                                                                                                              Условие задачи:
//                                                                                                                              Напишите метод, который бы проверял, делится ли число на 2 без остатка или нет. Например,
//                                                                                                                                 если число 4, тогда метод должен возвращать true
//                                                                                                                                если число 5, тогда метод должен возвращать false
//                                                                                                                                 если число 6, тогда метод должен возвращать true
//                                                                                                                                            и т.д.
//                                                                                                                              Комментарии к задаче:Поскольку стоит задача написать метод, который бы проверял,
//                                                                                                                                 делится ли число на 2 без остатка или нет. Значит, речь идет о том, что мы должны проверять число на четность/нечетность.
//                                                                                                                                 В этом нам поможет оператор деления по модулю.
//
//                                                                                                                                  ЗРОБЛЕНО
//                                                                                                                                   Условие задачи:
//                                                                                                                                   Написать метод возведения числа в квадрат.
//                                                                                                                                    И далее к результату прибавить число 2.
//                                                                                                                                      Например,
//                                                                                                                                          если Вы ввели число 2, тогда в консоль должно быть выведено число 4 и 6
//                                                                                                                                   если Вы ввели число 3, тогда в консоль должно быть выведено число 9 и 11
//                                                                                                                               если Вы ввели число 5, тогда в консоль должно быть выведено число 25 и 27
//                                                                                                                                           и т.д.
//                                                                                                                                   Комментарии к задаче:Начиная решать данную задачу, необходимо попробовать вывести общую формулу возведения числа в квадрат.
//                                                                                                                                  Как видите, общая формула возведения числа в квадрат выглядит как a*a.Во втором выводе ответа необходимо вывести квадрат числа +2

//                                                                                                                                   ЗРОБЛЕНО
//                                                                                                                                  Задача 2.
//                                                                                                                                    Возвести число в куб используя Math. Используя методы
//                                                                                                                                  ЗРОБЛЕНО
//                                                                                                                                  Задача 3.
//                                                                                                                                     Возвести в степень
//
//        Условие задачи:
//        Необходимо написать метод, который бы возводил число в степень. И далее два числа, возведенные в степень, должны быть просуммированы, а результат выведен в консоль.
//        Комментарии к задаче:
//        Изначально Вам необходимо вывести общую формулу возведения числа в степень.
//        а в степени b = 3 в степени 2 = 3*3=9
//        а в степени b = 2 в степени 6 = 2*2*2*2*2*2=64
//
//        Необходимо использовать цикл for. Причем обратите внимание, что в цикле for Необходимо реализовать i<=b, потому что нам необходимо умножить а на себя b раз.
//        И далее вызвали метод 2 раза для a = 3, b = 2  и a=2 и b=6. А также просуммировать метод (3,2) и метод(2,6).
